Learning/C1_TEST_MESH_2_BLOCKS/0_org/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//The value for k is a function of velocity, and turbulence intensity

dimensions      [0 2 -2 0 0 0 0];

//internalField   uniform 0.00015;
internalField   uniform 0.09375;

boundaryField
{
    inlet
    {
        //type            inletOutlet; // inletOutlet combination uses inletValue I think
        //inletValue	uniform 0.09375;
        
        type		fixedValue;
        value           uniform 0.09375;
    }
    outlet
    {
        type            zeroGradient;
    }
//Ensure that the parameters below are in line with the parameters in the blockMeshDict
    minY
    {
        //type		slip;
        type            symmetryPlane;
    }
    maxY
    {
        //type		slip;
        type            symmetryPlane;
    }
    minZ
    {
        //type		slip;
        type            symmetryPlane;
    }
    maxZ
    {
        //type		slip;
        type            symmetryPlane;
    }
    window_wall
    {
        type            kqRWallFunction;
        value		uniform 0.09375;
    }
}

// ************************************************************************* //
