Learning/C1_TEST_MESH_2_BLOCKS/0_org/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

//Ensure that the parameters below are in line with the blockMeshDict parameters.
// The 
    minY
    {
        //type		slip;
        type            symmetryPlane;
    }

    maxY
    {
        //type		slip;
        type            symmetryPlane;
    }

    minZ
    {
        //type		slip;
        type            symmetryPlane;
    }

    maxZ
    {
        //type		slip;
        type            symmetryPlane;
    }

    window_wall // Need to fix this is not right. Should be zeroGradient
    {
	//type		noSlip;
	type		zeroGradient;
    }
}

// ************************************************************************* //
