Learning/C1_TEST_MESH_2_BLOCKS/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  13                                    |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;


// Block 1
xmin -10; //inlet refer to COST 732 / Franke et al. best-practice guidance for urban CFD
xmax  0.05; //outlet
ymin -2.5;
ymax  2.5;
zmin -2.5;
zmax  2.5;

// Block 2
xmin2 0.05; //inlet refer to COST 732 / Franke et al. best-practice guidance for urban CFD
xmax2 30; //outlet
ymin2 -2.5;
ymax2  2.5;
zmin2 -2.5;
zmax2  2.5;



//xcells 20;
//ycells 20;
//zcells 20;

// Block 1 number of cells

lx #calc "$xmax - $xmin";
dx 0.5; //Originally 0.5
//dx 1;
xcells #calc "abs(($lx)/($dx))";

ly #calc "$ymax - $ymin";
dy 0.5; //Originally 0.5
//dy 1;
ycells #calc "abs(($ly)/($dy))";

lz #calc "$zmax - $zmin";
//dz 20;	//BL OK at bottom - Better mesh at corners at the bottom
dz 0.5;	//Originally 0.5	//BL colapses at bottom - Mesh at the bottom corners is uglier
//dz 1;
zcells #calc "abs(($lz)/($dz))";


// Block 2 number of cells

lx2 #calc "$xmax2 - $xmin2";
dx2 0.5; //Originally 0.5
//dx 1;
xcells2 #calc "abs(($lx2)/($dx2))";

ly2 #calc "$ymax2 - $ymin2";
dy2 0.5; //Originally 0.5
//dy 1;
ycells2 #calc "abs(($ly2)/($dy2))";

lz2 #calc "$zmax2 - $zmin2";
//dz 20;	//BL OK at bottom - Better mesh at corners at the bottom
dz2 0.5;	//Originally 0.5	//BL colapses at bottom - Mesh at the bottom corners is uglier
//dz 1;
zcells2 #calc "abs(($lz2)/($dz2))";


// Background mesh for snappyHexMesh around constant/triSurface/Window_1.stl.
// The STL bounds are approximately:
//     min (0 -2.5 -2.5), max (0.1 2.5 2.5)
//
// Requested domain:
//   - 20 m upstream of the window in the negative x direction
//   - 30 m downstream of the window in the positive x direction
//   - same width and height as the STL wall: 5 m by 5 m
// As of 2026-05-09 the window begins at x=0 and is extruded in the positive x-axis direction. 

/*

vertices        
(
	($xmin  $ymin  $zmin) // 0
	($xmax  $ymin  $zmin) // 1
	($xmax  $ymax  $zmin) // 2
	($xmin  $ymax  $zmin) // 3
	($xmin  $ymin  $zmax) // 4
	($xmax  $ymin  $zmax) // 5
	($xmax  $ymax  $zmax) // 6
	($xmin  $ymax  $zmax) // 7

 	($xmax  $ymin  $zmin)  // 8, or 1
	($xmax2  $ymin  $zmin) // 8
	($xmax2  $ymax  $zmin) // 9
	($xmax  $ymax  $zmin) // 11, or 2
	($xmax  $ymin  $zmax) // 12, or 5
	($xmax2  $ymin  $zmax) // 10
	($xmax2  $ymax  $zmax) // 11
	($xmax  $ymax  $zmax) // 15, or 6
);

//Block 1
blocks          
(
	hex (0 1 2 3 4 5 6 7) ($xcells $ycells $zcells) simpleGrading (1 1 1) // KEEP AT (1 1 1)

//Block 2
	hex (8 9 10 11 12 13 14 15) ($xcells2 $ycells2 $zcells2) simpleGrading (1 1 1) // KEEP AT (1 1 1)
);


edges
(
);

boundary
(

	inlet
	// minX originally
	{
		type patch;
		faces
		(
			(0 3 7 4)
		);
	}

	outlet
	// xmax originally
	{
		type patch;
		faces
		(
			(1 5 6 2)
		);
	}
	// While the first simulation was successful, the later iteration may not have 
        //symmetry, so the available options here for the "edge" of the virtual wind tunnel would be either slip
       	//or freestream conditions. 
	minY
	{
		//type	patch;
		type symmetryPlane;
		faces
		(
			(0 4 5 1)
		);
	}

	maxY
	{
		//type	patch;
		type symmetryPlane;
		faces
		(
			(3 2 6 7)
		);
	}
    
	minZ
	{
		//type	patch;
		type symmetryPlane;
		faces
		( 
			(0 3 2 1)
		);
	}

	maxZ
	{
		//type	patch;
		type symmetryPlane;
		faces
		( 
			(4 5 6 7)
		);
	}

//Block 2

	inlet2
	// minX originally
	{
		type patch;
		faces
		(
			(8 11 15 12)
		);
	}

	outlet2
	// xmax originally
	{
		type patch;
		faces
		(
			(9 13 14 10)
		);
	}
	// While the first simulation was successful, the later iteration may not have 
        //symmetry, so the available options here for the "edge" of the virtual wind tunnel would be either slip
       	//or freestream conditions. 
	minY2
	{
		//type	patch;
		type symmetryPlane;
		faces
		(
			(8 12 13 9)
		);
	}

	maxY2
	{
		//type	patch;
		type symmetryPlane;
		faces
		(
			(11 10 14 15)
		);
	}
    
	minZ2
	{
		//type	patch;
		type symmetryPlane;
		faces
		( 
			(8 9 10 11)
		);
	}

	maxZ2
	{
		//type	patch;
		type symmetryPlane;
		faces
		( 
			(12 15 14 13)
		);
	}
    
);
*/

  vertices
  (
      ($xmin  $ymin  $zmin) // 0
      ($xmax  $ymin  $zmin) // 1
      ($xmax  $ymax  $zmin) // 2
      ($xmin  $ymax  $zmin) // 3
      ($xmin  $ymin  $zmax) // 4
      ($xmax  $ymin  $zmax) // 5
      ($xmax  $ymax  $zmax) // 6
      ($xmin  $ymax  $zmax) // 7

      ($xmax2 $ymin  $zmin) // 8
      ($xmax2 $ymax  $zmin) // 9
      ($xmax2 $ymin  $zmax) // 10
      ($xmax2 $ymax  $zmax) // 11
  );

  blocks
  (
      hex (0 1 2 3 4 5 6 7)      ($xcells  $ycells  $zcells)  simpleGrading (1 1 1)
      hex (1 8 9 2 5 10 11 6)    ($xcells2 $ycells2 $zcells2) simpleGrading (1 1 1)
  );

  //Then remove outlet for block 1 and remove inlet2 for block 2. The shared face (1 2 6 5) becomes internal.

  //Use boundary like this:

  boundary
  (
      inlet
      {
          type patch;
          faces
          (
              (0 3 7 4)
          );
      }

      outlet
      {
          type patch;
          faces
          (
              (8 10 11 9)
          );
      }

      minY
      {
          type symmetryPlane;
          faces
          (
              (0 4 5 1)
              (1 5 10 8)
          );
      }

      maxY
      {
          type symmetryPlane;
          faces
          (
              (3 2 6 7)
              (2 9 11 6)
          );
      }

      minZ
      {
          type symmetryPlane;
          faces
          (
              (0 1 2 3)
              (1 8 9 2)
          );
      }

      maxZ
      {
          type symmetryPlane;
          faces
          (
              (4 7 6 5)
              (5 6 11 10)
          );
      }
  );


mergePatchPairs 
(
);

// ************************************************************************* //
